In [1]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns

In [2]:
df = pd.read_csv("movies_metadata.csv")

In [3]:
df.head()

,adult,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,overview,...,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count
0,False,"{'id': 10194, 'name': 'Toy Story Collection', ...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...",...,1995-10-30,373554033,81.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,Toy Story,False,7.7,5415
1,False,NaN,65000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",NaN,8844,tt0113497,en,Jumanji,When siblings Judy and Peter discover an encha...,...,1995-12-15,262797249,104.0,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,Roll the dice and unleash the excitement!,Jumanji,False,6.9,2413
2,False,"{'id': 119050, 'name': 'Grumpy Old Men Collect...",0,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...",NaN,15602,tt0113228,en,Grumpier Old Men,A family wedding reignites the ancient feud be...,...,1995-12-22,0,101.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Still Yelling. Still Fighting. Still Ready for...,Grumpier Old Men,False,6.5,92
3,False,NaN,16000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",NaN,31357,tt0114885,en,Waiting to Exhale,"Cheated on, mistreated and stepped on, the wom...",...,1995-12-22,81452156,127.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Friends are the people who let you be yourself...,Waiting to Exhale,False,6.1,34
4,False,"{'id': 96871, 'name': 'Father of the Bride Col...",0,"[{'id': 35, 'name': 'Comedy'}]",NaN,11862,tt0113041,en,Father of the Bride Part II,Just when George Banks has recovered from his ...,...,1995-02-10,76578911,106.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Just When His World Is Back To Normal... He's ...,Father of the Bride Part II,False,5.7,173

1) Write a Python Pandas program to get the columns of the DataFrame (movies_metadata.csv file).

In [4]:
df.columns

Index(['adult', 'belongs_to_collection', 'budget', 'genres', 'homepage', 'id',
       'imdb_id', 'original_language', 'original_title', 'overview',
       'popularity', 'poster_path', 'production_companies',
       'production_countries', 'release_date', 'revenue', 'runtime',
       'spoken_languages', 'status', 'tagline', 'title', 'video',
       'vote_average', 'vote_count'],
      dtype='object')

2) Write a Pandas program to get the information of the DataFrame (movies_metadata.csv file)including data types and memory usage.

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 24 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   adult                  50 non-null     bool
 1   belongs_to_collection  10 non-null     object
 2   budget                 50 non-null     int64
 3   genres                 50 non-null     object
 4   homepage               5 non-null      object
 5   id                     50 non-null     int64
 6   imdb_id                50 non-null     object
 7   original_language      50 non-null     object
 8   original_title         50 non-null     object
 9   overview               49 non-null     object
 10  popularity             50 non-null     float64
 11  poster_path            50 non-null     object
 12  production_companies   50 non-null     object
 13  production_countries   50 non-null     object
 14  release_date           50 non-null     object
 15  revenue                50 non-null     int64
 16  runtime                50 non-null     float64
 17  spoken_languages       50 non-null     object
 18  status                 50 non-null     object
 19  tagline                41 non-null     object
 20  title                  50 non-null     object
 21  video                  50 non-null     bool
 22  vote_average           50 non-null     float64
 23  vote_count             50 non-null     int64
dtypes: bool(2), float64(3), int64(4), object(15)
memory usage: 8.8+ KB

3) Write a Pandas program to get the details of the third movie of the DataFrame (movies_metadata.csv file).

In [6]:
df.iloc[2]

adult                                                                False
belongs_to_collection    {'id': 119050, 'name': 'Grumpy Old Men Collect...
budget                                                                   0
genres                   [{'id': 10749, 'name': 'Romance'}, {'id': 35, ...
homepage                                                               NaN
id                                                                   15602
imdb_id                                                          tt0113228
original_language                                                       en
original_title                                            Grumpier Old Men
overview                 A family wedding reignites the ancient feud be...
popularity                                                         11.7129
poster_path                               /6ksm1sjKMFLbO7UY2i6G1ju9SML.jpg
production_companies     [{'name': 'Warner Bros.', 'id': 6194}, {'name'...
production_countries     [{'iso_3166_1': 'US', 'name': 'United States o...
release_date                                                    1995-12-22
revenue                                                                  0
runtime                                                              101.0
spoken_languages                  [{'iso_639_1': 'en', 'name': 'English'}]
status                                                            Released
tagline                  Still Yelling. Still Fighting. Still Ready for...
title                                                     Grumpier Old Men
video                                                                False
vote_average                                                           6.5
vote_count                                                              92
Name: 2, dtype: object

4) Write a Pandas program to count the number of rows and columns of the DataFrame (movies_metadata.csv file).

In [7]:
df.shape

(50, 24)

5) Write a Pandas program to get the details of the columns title and genres of the DataFrame.

In [8]:
df[["title","genres"]]

,title,genres
0,Toy Story,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '..."
1,Jumanji,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '..."
2,Grumpier Old Men,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, ..."
3,Waiting to Exhale,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam..."
4,Father of the Bride Part II,"[{'id': 35, 'name': 'Comedy'}]"
5,Heat,"[{'id': 28, 'name': 'Action'}, {'id': 80, 'nam..."
6,Sabrina,"[{'id': 35, 'name': 'Comedy'}, {'id': 10749, '..."
7,Tom and Huck,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam..."
8,Sudden Death,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam..."
9,GoldenEye,"[{'id': 12, 'name': 'Adventure'}, {'id': 28, '..."
10,The American President,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam..."
11,Dracula: Dead and Loving It,"[{'id': 35, 'name': 'Comedy'}, {'id': 27, 'nam..."
12,Balto,"[{'id': 10751, 'name': 'Family'}, {'id': 16, '..."
13,Nixon,"[{'id': 36, 'name': 'History'}, {'id': 18, 'na..."
14,Cutthroat Island,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam..."
15,Casino,"[{'id': 18, 'name': 'Drama'}, {'id': 80, 'name..."
16,Sense and Sensibility,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n..."
17,Four Rooms,"[{'id': 80, 'name': 'Crime'}, {'id': 35, 'name..."
18,Ace Ventura: When Nature Calls,"[{'id': 80, 'name': 'Crime'}, {'id': 35, 'name..."
19,Money Train,"[{'id': 28, 'name': 'Action'}, {'id': 35, 'nam..."
20,Get Shorty,"[{'id': 35, 'name': 'Comedy'}, {'id': 53, 'nam..."
21,Copycat,"[{'id': 18, 'name': 'Drama'}, {'id': 53, 'name..."
22,Assassins,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam..."
23,Powder,"[{'id': 18, 'name': 'Drama'}, {'id': 14, 'name..."
24,Leaving Las Vegas,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n..."
25,Othello,"[{'id': 18, 'name': 'Drama'}]"
26,Now and Then,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam..."
27,Persuasion,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n..."
28,The City of Lost Children,"[{'id': 14, 'name': 'Fantasy'}, {'id': 878, 'n..."
29,Shanghai Triad,"[{'id': 18, 'name': 'Drama'}, {'id': 80, 'name..."
30,Dangerous Minds,"[{'id': 18, 'name': 'Drama'}, {'id': 80, 'name..."
31,Twelve Monkeys,"[{'id': 878, 'name': 'Science Fiction'}, {'id'..."
32,Wings of Courage,"[{'id': 10749, 'name': 'Romance'}, {'id': 12, ..."
33,Babe,"[{'id': 14, 'name': 'Fantasy'}, {'id': 18, 'na..."
34,Carrington,"[{'id': 36, 'name': 'History'}, {'id': 18, 'na..."
35,Dead Man Walking,"[{'id': 18, 'name': 'Drama'}]"
36,Across the Sea of Time,"[{'id': 12, 'name': 'Adventure'}, {'id': 36, '..."
37,It Takes Two,"[{'id': 35, 'name': 'Comedy'}, {'id': 10751, '..."
38,Clueless,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam..."
39,"Cry, the Beloved Country","[{'id': 18, 'name': 'Drama'}]"
40,Richard III,"[{'id': 18, 'name': 'Drama'}, {'id': 10752, 'n..."
41,Dead Presidents,"[{'id': 28, 'name': 'Action'}, {'id': 80, 'nam..."
42,Restoration,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n..."
43,Mortal Kombat,"[{'id': 28, 'name': 'Action'}, {'id': 14, 'nam..."
44,To Die For,"[{'id': 14, 'name': 'Fantasy'}, {'id': 18, 'na..."
45,How To Make An American Quilt,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n..."
46,Se7en,"[{'id': 80, 'name': 'Crime'}, {'id': 9648, 'na..."
47,Pocahontas,"[{'id': 12, 'name': 'Adventure'}, {'id': 16, '..."
48,When Night Is Falling,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n..."
49,The Usual Suspects,"[{'id': 18, 'name': 'Drama'}, {'id': 80, 'name..."

6) Write a Pandas program to get the details of the movie with title 'Grumpier Old Men'.

In [16]:
df[df["title"] =="Grumpier Old Men"]

,adult,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,overview,...,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count
2,False,"{'id': 119050, 'name': 'Grumpy Old Men Collect...",0,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...",NaN,15602,tt0113228,en,Grumpier Old Men,A family wedding reignites the ancient feud be...,...,1995-12-22,0,101.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Still Yelling. Still Fighting. Still Ready for...,Grumpier Old Men,False,6.5,92

In [18]:
df = df.set_index("title")

In [19]:
df.loc["Grumpier Old Men"]

adult                                                                False
belongs_to_collection    {'id': 119050, 'name': 'Grumpy Old Men Collect...
budget                                                                   0
genres                   [{'id': 10749, 'name': 'Romance'}, {'id': 35, ...
homepage                                                               NaN
id                                                                   15602
imdb_id                                                          tt0113228
original_language                                                       en
original_title                                            Grumpier Old Men
overview                 A family wedding reignites the ancient feud be...
popularity                                                         11.7129
poster_path                               /6ksm1sjKMFLbO7UY2i6G1ju9SML.jpg
production_companies     [{'name': 'Warner Bros.', 'id': 6194}, {'name'...
production_countries     [{'iso_3166_1': 'US', 'name': 'United States o...
release_date                                                    1995-12-22
revenue                                                                  0
runtime                                                              101.0
spoken_languages                  [{'iso_639_1': 'en', 'name': 'English'}]
status                                                            Released
tagline                  Still Yelling. Still Fighting. Still Ready for...
video                                                                False
vote_average                                                           6.5
vote_count                                                              92
Name: Grumpier Old Men, dtype: object

7) Write a Pandas program to get the details of  fifth movie of the DataFrame.

In [20]:
df.iloc[4]

adult                                                                False
belongs_to_collection    {'id': 96871, 'name': 'Father of the Bride Col...
budget                                                                   0
genres                                      [{'id': 35, 'name': 'Comedy'}]
homepage                                                               NaN
id                                                                   11862
imdb_id                                                          tt0113041
original_language                                                       en
original_title                                 Father of the Bride Part II
overview                 Just when George Banks has recovered from his ...
popularity                                                        8.387519
poster_path                               /e64sOI48hQXyru7naBFyssKFxVd.jpg
production_companies     [{'name': 'Sandollar Productions', 'id': 5842}...
production_countries     [{'iso_3166_1': 'US', 'name': 'United States o...
release_date                                                    1995-02-10
revenue                                                           76578911
runtime                                                              106.0
spoken_languages                  [{'iso_639_1': 'en', 'name': 'English'}]
status                                                            Released
tagline                  Just When His World Is Back To Normal... He's ...
video                                                                False
vote_average                                                           5.7
vote_count                                                             173
Name: Father of the Bride Part II, dtype: object

8) Write a Pandas program to create a smaller DataFrame with a subset of all features.

In [29]:
df = df.reset_index()

In [31]:
df2 = df[["title","original_title","original_language","budget","release_date","revenue","runtime"]]
df2.head()

,title,original_title,original_language,budget,release_date,revenue,runtime
0,Toy Story,Toy Story,en,30000000,1995-10-30,373554033,81.0
1,Jumanji,Jumanji,en,65000000,1995-12-15,262797249,104.0
2,Grumpier Old Men,Grumpier Old Men,en,0,1995-12-22,0,101.0
3,Waiting to Exhale,Waiting to Exhale,en,16000000,1995-12-22,81452156,127.0
4,Father of the Bride Part II,Father of the Bride Part II,en,0,1995-02-10,76578911,106.0

9) Write a Pandas program to display the first 10 rows of the DataFrame.

In [32]:
df.head(10)

,title,adult,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,...,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,video,vote_average,vote_count
0,Toy Story,False,"{'id': 10194, 'name': 'Toy Story Collection', ...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,...,"[{'iso_3166_1': 'US', 'name': 'United States o...",1995-10-30,373554033,81.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,False,7.7,5415
1,Jumanji,False,NaN,65000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",NaN,8844,tt0113497,en,Jumanji,...,"[{'iso_3166_1': 'US', 'name': 'United States o...",1995-12-15,262797249,104.0,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,Roll the dice and unleash the excitement!,False,6.9,2413
2,Grumpier Old Men,False,"{'id': 119050, 'name': 'Grumpy Old Men Collect...",0,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...",NaN,15602,tt0113228,en,Grumpier Old Men,...,"[{'iso_3166_1': 'US', 'name': 'United States o...",1995-12-22,0,101.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Still Yelling. Still Fighting. Still Ready for...,False,6.5,92
3,Waiting to Exhale,False,NaN,16000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",NaN,31357,tt0114885,en,Waiting to Exhale,...,"[{'iso_3166_1': 'US', 'name': 'United States o...",1995-12-22,81452156,127.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Friends are the people who let you be yourself...,False,6.1,34
4,Father of the Bride Part II,False,"{'id': 96871, 'name': 'Father of the Bride Col...",0,"[{'id': 35, 'name': 'Comedy'}]",NaN,11862,tt0113041,en,Father of the Bride Part II,...,"[{'iso_3166_1': 'US', 'name': 'United States o...",1995-02-10,76578911,106.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Just When His World Is Back To Normal... He's ...,False,5.7,173
5,Heat,False,NaN,60000000,"[{'id': 28, 'name': 'Action'}, {'id': 80, 'nam...",NaN,949,tt0113277,en,Heat,...,"[{'iso_3166_1': 'US', 'name': 'United States o...",1995-12-15,187436818,170.0,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,A Los Angeles Crime Saga,False,7.7,1886
6,Sabrina,False,NaN,58000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 10749, '...",NaN,11860,tt0114319,en,Sabrina,...,"[{'iso_3166_1': 'DE', 'name': 'Germany'}, {'is...",1995-12-15,0,127.0,"[{'iso_639_1': 'fr', 'name': 'Français'}, {'is...",Released,You are cordially invited to the most surprisi...,False,6.2,141
7,Tom and Huck,False,NaN,0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,45325,tt0112302,en,Tom and Huck,...,"[{'iso_3166_1': 'US', 'name': 'United States o...",1995-12-22,0,97.0,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,The Original Bad Boys.,False,5.4,45
8,Sudden Death,False,NaN,35000000,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,9091,tt0114576,en,Sudden Death,...,"[{'iso_3166_1': 'US', 'name': 'United States o...",1995-12-22,64350171,106.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Terror goes into overtime.,False,5.5,174
9,GoldenEye,False,"{'id': 645, 'name': 'James Bond Collection', '...",58000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 28, '...",http://www.mgm.com/view/movie/757/Goldeneye/,710,tt0113189,en,GoldenEye,...,"[{'iso_3166_1': 'GB', 'name': 'United Kingdom'...",1995-11-16,352194034,130.0,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,No limits. No fears. No substitutes.,False,6.6,1194

10) Write a Pandas program to sort the DataFrame based on release_date.

In [35]:
df2.sort_values("release_date").head(10)

,title,original_title,original_language,budget,release_date,revenue,runtime
4,Father of the Bride Part II,Father of the Bride Part II,en,0,1995-02-10,76578911,106.0
29,Shanghai Triad,摇啊摇，摇到外婆桥,zh,0,1995-04-30,0,108.0
48,When Night Is Falling,When Night Is Falling,en,0,1995-05-05,0,96.0
28,The City of Lost Children,La Cité des Enfants Perdus,fr,18000000,1995-05-16,1738611,108.0
44,To Die For,To Die For,en,20000000,1995-05-20,21284514,106.0
47,Pocahontas,Pocahontas,en,55000000,1995-06-14,346079773,81.0
33,Babe,Babe,en,30000000,1995-07-18,254134910,89.0
38,Clueless,Clueless,en,12000000,1995-07-19,0,97.0
49,The Usual Suspects,The Usual Suspects,en,6000000,1995-07-19,23341568,106.0
30,Dangerous Minds,Dangerous Minds,en,0,1995-08-11,180000000,99.0

11) Write a Pandas program to access those movies, released after 1995-01-01

In [38]:
df2[df2.release_date>"1995-01-01"].head(10)

,title,original_title,original_language,budget,release_date,revenue,runtime
0,Toy Story,Toy Story,en,30000000,1995-10-30,373554033,81.0
1,Jumanji,Jumanji,en,65000000,1995-12-15,262797249,104.0
2,Grumpier Old Men,Grumpier Old Men,en,0,1995-12-22,0,101.0
3,Waiting to Exhale,Waiting to Exhale,en,16000000,1995-12-22,81452156,127.0
4,Father of the Bride Part II,Father of the Bride Part II,en,0,1995-02-10,76578911,106.0
5,Heat,Heat,en,60000000,1995-12-15,187436818,170.0
6,Sabrina,Sabrina,en,58000000,1995-12-15,0,127.0
7,Tom and Huck,Tom and Huck,en,0,1995-12-22,0,97.0
8,Sudden Death,Sudden Death,en,35000000,1995-12-22,64350171,106.0
9,GoldenEye,GoldenEye,en,58000000,1995-11-16,352194034,130.0

12) Write a Pandas program to sort movies on runtime in descending order.

In [40]:
df2.sort_values("runtime",ascending=False).head(10)

,title,original_title,original_language,budget,release_date,revenue,runtime
13,Nixon,Nixon,en,44000000,1995-12-22,13681765,192.0
15,Casino,Casino,en,52000000,1995-11-22,116112375,178.0
5,Heat,Heat,en,60000000,1995-12-15,187436818,170.0
16,Sense and Sensibility,Sense and Sensibility,en,16500000,1995-12-13,135000000,136.0
22,Assassins,Assassins,en,50000000,1995-10-06,30303072,132.0
9,GoldenEye,GoldenEye,en,58000000,1995-11-16,352194034,130.0
31,Twelve Monkeys,Twelve Monkeys,en,29500000,1995-12-29,168840000,129.0
46,Se7en,Se7en,en,33000000,1995-09-22,327311859,127.0
3,Waiting to Exhale,Waiting to Exhale,en,16000000,1995-12-22,81452156,127.0
6,Sabrina,Sabrina,en,58000000,1995-12-15,0,127.0

13) Write a Pandas program to get those movies whose revenue more than 2 million and spent less than 1 million.

In [67]:
df2[(df2.revenue > 2000000) & (df2.budget < 1000000)]

,title,original_title,original_language,budget,release_date,revenue,runtime
4,Father of the Bride Part II,Father of the Bride Part II,en,0,1995-02-10,76578911,106.0
12,Balto,Balto,en,0,1995-12-22,11348324,78.0
30,Dangerous Minds,Dangerous Minds,en,0,1995-08-11,180000000,99.0

14) Write a Pandas program to get the longest runtime and shortest runtime.

In [60]:
df2[df2.runtime == df2.runtime.max()]

,title,original_title,original_language,budget,release_date,revenue,runtime
13,Nixon,Nixon,en,44000000,1995-12-22,13681765,192.0

In [61]:
df2[df2.runtime == df2.runtime.min()]

,title,original_title,original_language,budget,release_date,revenue,runtime
32,Wings of Courage,"Guillaumet, les ailes du courage",fr,0,1996-09-18,0,50.0

15) Write a Pandas program to calculate the number of votes garnered by the 70% movie.

In [62]:
df['vote_count'].quantile(0.70)

402.69999999999993

16) Write a Pandas program to display the movies (title, runtime) longer than 30 minutes and shorter than 360 minutes.

In [63]:
df3 = df2[["title","runtime"]]
df3.head()

                         title  runtime
0                    Toy Story     81.0
1                      Jumanji    104.0
2             Grumpier Old Men    101.0
3            Waiting to Exhale    127.0
4  Father of the Bride Part II    106.0

In [70]:
df3[(df3.runtime >= 30) & (df3.runtime <= 360)].head(10)

                         title  runtime
0                    Toy Story     81.0
1                      Jumanji    104.0
2             Grumpier Old Men    101.0
3            Waiting to Exhale    127.0
4  Father of the Bride Part II    106.0
5                         Heat    170.0
6                      Sabrina    127.0
7                 Tom and Huck     97.0
8                 Sudden Death    106.0
9                    GoldenEye    130.0

17) Write a Pandas program to display the movies (title, number of votes) that received specified number of votes.

In [71]:
df4 = df[["title","vote_count"]]

In [73]:
n = 700
df4[df4.vote_count>=n]

                             title  vote_count
0                        Toy Story        5415
1                          Jumanji        2413
5                             Heat        1886
9                        GoldenEye        1194
15                          Casino        1343
18  Ace Ventura: When Nature Calls        1128
31                  Twelve Monkeys        2470
33                            Babe         756
38                        Clueless         828
46                           Se7en        5915
47                      Pocahontas        1509
49              The Usual Suspects        3334